{
    "starDesc": {
        "starProperties": [{
                "name": "Spectral Type",
                "desc": "The spectral designation of a star."
            },
            {
                "name": "Color",
                "desc": "The color of a star's light. Bluer stars are usually hotter while redder stars are cooler."
            },
            {
                "name": "Star Type",
                "desc": "The luminosity/size class of a star. Ranges from hypergiant down to dwarf; Main Sequence stars are in the middle of the spectrum."
            },
            {
                "name": "Luminosity",
                "desc": "The amount of energy emitted at the surface of a star."
            },
            {
                "name": "Apparent Magnitude",
                "desc": "How bright a star appears from Earth."
            },
            {
                "name": "Absolute Magnitude",
                "desc": "How bright a star appears from a standard distance of 10 parsecs."
            }
        ],
        "position": [{
                "name": "Distance",
                "desc": "The distance a star is from Earth in light years."
            },
            {
                "name": "Right Ascension",
                "desc": "The latitude of the celestial sphere: the angular distance measured eastward from the Sun's position at the vernal equinox."
            },
            {
                "name": "Declination",
                "desc": "The longitude of the celestial sphere: the angular distance of a star north/south of the celestial equator as viewed from Earth."
            }
        ],
        "dimensions": [{
                "name": "Mass",
                "desc": "The total amount of matter contained in a star."
            },
            {
                "name": "Volume",
                "desc": "The total amount of space occupied by a star."
            },
            {
                "name": "Mean Radius",
                "desc": "The average distance between a star's center and its surface."
            },
            {
                "name": "Density",
                "desc": "The ratio of mass to volume in a star; the amount of matter in a certain amount of space."
            },
            {
                "name": "Core Density",
                "desc": "The ratio of mass to volume in a star's core."
            }
        ],
        "rotation": [{
                "name": "Rotation Direction",
                "desc": "The direction of a star's spin on the \"top\" of the solar system's plane (the side containing Earth's north pole). Prograde means counterclockwise; retrograde means clockwise."
            },
            {
                "name": "Rotation Period",
                "desc": "The total time taken for a star to complete one full rotation of its axis relative to the background stars (sidereal rotation)."
            },
            {
                "name": "Obliquity to Ecliptic",
                "desc": "The angle between a star's rotational axis and a line perpendicular to the Earth's orbital plane (ecliptic)."
            },
            {
                "name": "Speed Relative to Stars",
                "desc": "The speed a star (and its entire solar system) is moving relative to other stars in the background."
            }
        ],
        "orbit": [{
                "name": "Orbiting",
                "desc": "The primary object which a component star in a multiple star system is orbiting."
            },
            {
                "name": "Orbital Radius",
                "desc": "The distance between a star and the primary object it orbits."
            },
            {
                "name": "Orbital Period",
                "desc": "The total time taken for a star to complete one full orbit in its multiple star system."
            },
            {
                "name": "Orbital Velocity",
                "desc": "The velocity at which a star is moving relative to the object it orbits."
            }
        ],
        "surface": [{
                "name": "Surface Gravity",
                "desc": "The acceleration due to gravity experienced at the surface of a star."
            },
            {
                "name": "Escape Velocity",
                "desc": "The minimum speed required for an object to escape the gravitational pull of a star."
            },
            {
                "name": "Surface Temperature",
                "desc": "The average temperature in a star's chromosphere, the main layer of its atmosphere."
            },
            {
                "name": "Core Temperature",
                "desc": "The average temperature in a star's core."
            },
            {
                "name": "Core Pressure",
                "desc": "The average pressure in a star's core."
            },
            {
                "name": "Mass Conversion Rate",
                "desc": "The rate at which mass is converted into energy through fusion in a star's core."
            }
        ]
    },

    "planetDesc": {
        "orbit": [{
                "name": "Orbiting",
                "desc": "The star which the planet is orbiting around."
            },
            {
                "name": "Orbital Radius",
                "desc": "The average distance between a planet and its star (semi-major axis)."
            },
            {
                "name": "Perihelion",
                "desc": "The closest distance between a planet and its star during its orbit."
            },
            {
                "name": "Aphelion",
                "desc": "The farthest distance between a planet and its star during its orbit."
            },
            {
                "name": "Orbital Period",
                "desc": "The total time taken for a planet to complete one full orbit (sidereal period); the length of its year."
            },
            {
                "name": "Orbital Velocity",
                "desc": "The average velocity at which a planet is moving on its orbit."
            },
            {
                "name": "Orbital Inclination",
                "desc": "The angle between another planet's orbital plane and Earth's orbital plane (the ecliptic)."
            },
            {
                "name": "Orbital Eccentricity",
                "desc": "The measure of how elliptical a planet's orbit is. 0 indicates a perfect circular orbit, while values closer to 1 are more elliptical."
            }
        ],
        "rotation": [{
                "name": "Rotation Direction",
                "desc": "The direction of a planet's spin on the \"top\" of the solar system's plane (the side containing Earth's north pole). Prograde means counterclockwise; retrograde means clockwise."
            },
            {
                "name": "Rotation Period",
                "desc": "The total time taken for a planet to complete one full rotation of its axis relative to the background stars (sidereal rotation)."
            },
            {
                "name": "Length of Day",
                "desc": "The total time between instances of a planet's star appearing at the same position in the sky. Slightly different than its rotation period due to the planet's orbit around its star; for planets with longer rotation periods and shorter orbital periods, the day length differs greatly from the rotation period."
            },
            {
                "name": "Obliquity to Orbit",
                "desc": "The angle between a planet's rotational axis and a line perpendicular to its orbital plane; axial tilt. 0ยบ means the planet rotates perpendicular to its orbit. This angle is the cause of seasons; angles closer to 90ยบ would cause greater seasonal variations."
            }
        ],
        "dimensions": [{
                "name": "Mass",
                "desc": "The total amount of matter contained in a planet."
            },
            {
                "name": "Volume",
                "desc": "The total amount of space occupied by a planet."
            },
            {
                "name": "Mean Radius",
                "desc": "The average distance between a planet's center and its surface."
            },
            {
                "name": "Equatorial Radius",
                "desc": "The distance between a planet's center and its surface at its equator."
            },
            {
                "name": "Polar Radius",
                "desc": "The distance between a planet's center and its surface at its poles."
            },
            {
                "name": "Core Radius",
                "desc": "The distance between a planet's center and the edge of its core."
            },
            {
                "name": "Ellipticity",
                "desc": "The measure of how elliptical a planet itself is; flattening. 0 indicates a perfect sphere, while values closer to 1 are more elliptical."
            },
            {
                "name": "Density",
                "desc": "The ratio of mass to volume in a planet; the amount of matter in a certain amount of space."
            }
        ],
        "surface": [{
                "name": "Surface Gravity",
                "desc": "The acceleration due to gravity experienced at the surface of a planet."
            },
            {
                "name": "Escape Velocity",
                "desc": "The minimum speed required for an object to escape the gravitational pull of a planet."
            },
            {
                "name": "Temperature",
                "desc": "The average temperature at a planet's surface."
            },
            {
                "name": "Pressure",
                "desc": "The average atmospheric pressure at a planet's surface. Values of 0 mean the planet has no atmosphere."
            },
            {
                "name": "Magnetic Field",
                "desc": "If the planet contains a magnetic field."
            }
        ],
        "moons": [{
            "name": "Moons",
            "desc": "Objects that orbit a planet."
        }]
    },

    "moonDesc": {
        "orbit": [{
                "name": "Orbiting",
                "desc": "The planet which the moon is orbiting around."
            },
            {
                "name": "Orbital Radius",
                "desc": "The average distance between a moon and the planet it orbits (semi-major axis)."
            },
            {
                "name": "Perigee",
                "desc": "The closest distance between a moon and its planet during its orbit."
            },
            {
                "name": "Apogee",
                "desc": "The farthest distance between a moon and its planet during its orbit."
            },
            {
                "name": "Orbital Direction",
                "desc": "The direction of a moon's orbit around its planet as viewed from the \"top\" of the solar system's plane (the side containing Earth's north pole). Prograde means counterclockwise; retrograde means clockwise."
            },
            {
                "name": "Orbital Period",
                "desc": "The total time taken for a moon to complete one full orbit (sidereal period)."
            },
            {
                "name": "Orbital Velocity",
                "desc": "The average velocity at which a moon is moving on its orbit."
            },
            {
                "name": "Orbital Inclination",
                "desc": "The angle between a moon's orbital plane and the orbital plane of the planet it orbits."
            },
            {
                "name": "Inclination to Equator",
                "desc": "The angle between a moon's orbital plane and the equator of the planet it orbits."
            },
            {
                "name": "Orbital Eccentricity",
                "desc": "The measure of how elliptical a moon's orbit is. 0 indicates a perfect circular orbit, while values closer to 1 are more elliptical."
            }
        ],
        "rotation": [{
                "name": "Rotation Direction",
                "desc": "The direction of a moon's spin on the \"top\" of the solar system's plane (the side containing Earth's north pole). Prograde means counterclockwise; retrograde means clockwise."
            },
            {
                "name": "Rotation Period",
                "desc": "The total time taken for a moon to complete one full rotation of its axis relative to the background stars. Some moons (like Earth's moon) have equivalent rotational and orbital periods, meaning they are tidally locked to their planet; only one side of the moon is ever visible from the planet."
            },
            {
                "name": "Obliquity to Orbit",
                "desc": "The angle between a moon's rotational axis and a line perpendicular to its orbital plane; axial tilt. 0ยบ means the moon rotates perpendicular to its orbit."
            },
            {
                "name": "Obliquity to Ecliptic",
                "desc": "The angle between a moon's rotational axis and a line perpendicular to the Earth's orbital plane (ecliptic)."
            },
            {
                "name": "Recession Rate",
                "desc": "The distance a moon moves away from its planet over a period of time. Negative values mean the moon is getting closer to its planet."
            }
        ],
        "dimensions": [{
                "name": "Mass",
                "desc": "The total amount of matter contained in a moon."
            },
            {
                "name": "Volume",
                "desc": "The total amount of space occupied by a moon."
            },
            {
                "name": "Mean Radius",
                "desc": "The average distance between a moon's center and its surface."
            },
            {
                "name": "Equatorial Radius",
                "desc": "The distance between a moon's center and its surface at its equator."
            },
            {
                "name": "Polar Radius",
                "desc": "The distance between a moon's center and its surface at its poles."
            },
            {
                "name": "Core Radius",
                "desc": "The distance between a moon's center and the edge of its core."
            },
            {
                "name": "Ellipticity",
                "desc": "The measure of how elliptical a moon itself is; flattening. 0 indicates a perfect sphere, while values closer to 1 are more elliptical."
            },
            {
                "name": "Density",
                "desc": "The ratio of mass to volume in a moon; the amount of matter in a certain amount of space."
            }
        ],
        "surface": [{
                "name": "Surface Gravity",
                "desc": "The acceleration due to gravity experienced at the surface of a moon."
            },
            {
                "name": "Escape Velocity",
                "desc": "The minimum speed required for an object to escape the gravitational pull of a moon."
            },
            {
                "name": "Temperature",
                "desc": "The average temperature at a moon's surface."
            },
            {
                "name": "Pressure",
                "desc": "The average atmospheric pressure at a moon's surface. Values of 0 mean the moon has no atmosphere."
            },
            {
                "name": "Magnetic Field",
                "desc": "If the moon contains a magnetic field."
            }
        ]
    },

    "objectDesc": {
        "orbit": [{
                "name": "Orbiting",
                "desc": "The body which the object is orbiting around."
            },
            {
                "name": "Orbital Radius",
                "desc": "The average distance between an object and the body it orbits (semi-major axis)."
            },
            {
                "name": "Perihelion",
                "desc": "The closest distance between an object and its orbiting body during its orbit."
            },
            {
                "name": "Orbital Period",
                "desc": "The total time taken for an object to complete one full orbit (sidereal period)."
            },
            {
                "name": "Orbital Inclination",
                "desc": "The angle between an object's orbital plane and Earth's orbital plane."
            },
            {
                "name": "Orbital Eccentricity",
                "desc": "The measure of how elliptical an object's orbit is. 0 indicates a perfect circular orbit, while values closer to 1 are more elliptical."
            }
        ],
        "rotation": [{
            "name": "Rotation Period",
            "desc": "The total time taken for an object to complete one full rotation of its axis relative to the background stars (sidereal rotation)."
        }],
        "dimensions": [{
                "name": "Mass",
                "desc": "Total amount of matter contained in an object."
            },
            {
                "name": "Diameter",
                "desc": "The average distance from one side of an object to the other."
            },
            {
                "name": "Size",
                "desc": "The diameter of an object on each axis (used for non-spherical objects)."
            }
        ]
    }
}
